# EXAMPLES FOR NER TASK

# EXAMPLE1
EXAMPLE1: dict[str, str] = {
    "text": "український бізнес почав використовувати КСВ як інструмент формування репутації... наприклад, проект « Життєлюб » Гаріка Корогодського.",
    "labels": [
        {"label": "MISC", "text": "КСВ"},
        {"label": "ORG", "text": "Життєлюб"},
        {"label": "PERS", "text": "Гаріка Корогодського"}
    ]
}

# EXAMPLE2
EXAMPLE2: dict[str, str] = {
    "text": "Збройні Сили України напередодні анексії Криму та втручання у Донбасі перебували в стані недофінансування ... чи буде коли-небудь зроблена оцінка пожертв громадян у 2014 р., але йдеться про сотні мільйонів доларів.",
    "labels": [
        {"label": "ORG", "text": "Збройні Сили України"},
        {"label": "LOG", "text": "Криму"},
        {"label": "LOG", "text": "Донбасі"},
        {"label": "DATE", "text": "2014 р."},
        {"label": "MON", "text": "сотні мільйонів доларів"}
    ]
}

# EXAMPLE3
EXAMPLE3: dict[str, str] = {
    "text": "Корпорація Roshen ... відновити протиповітряний « щит » над Києвом 2014 р. та придбала 430 снайперських гвинтівок, витративши 700-800 млн грн.",
    "labels": [
        {"label": "ORG", "text": "Roshen"},
        {"label": "LOG", "text": "Києвом"},
        {"label": "DATE", "text": "2014 р."},
        {"label": "QUANT", "text": "430"},
        {"label": "MON", "text": "700-800 млн грн"}
    ]
}

# EXAMPLE4
EXAMPLE4: dict[str, str] = {
    "text": "Фармацевтична компанія « Фармак » впроваджує великі проекти в сфері КСВ, експортує продукцію у понад 20 країн світу, в тому числі до Німеччини, Австралії, Швеції, США. У березні 2018 р. « Фармак » розпочав пілотний проект « Екошкола ».",
    "labels": [
        {"label": "ORG", "text": "Фармак"},
        {"label": "MISC", "text": "КСВ"},
        {"label": "LOG", "text": "Німеччини"},
        {"label": "LOG", "text": "Австралії"},
        {"label": "LOG", "text": "Швеції"},
        {"label": "LOG", "text": "США"},
        {"label": "DATE", "text": "березні 2018 р."},
        {"label": "ORG", "text": "Екошкола"}
    ]
}

# EXAMPLE5
EXAMPLE5: dict[str, str] = {
    "text": "Долучилися заступник голови райдержадміністрації Сергій Білецький ... у 2018 році школи Бориспільського району ... близько 30 % учнів потребують кваліфікованої логопедичної допомоги.",
    "labels": [
        {"label": "JOB", "text": "заступник голови райдержадміністрації"},
        {"label": "PERS", "text": "Сергій Білецький"},
        {"label": "ORG", "text": "райдержадміністрації"},
        {"label": "DATE", "text": "2018 році"},
        {"label": "LOG", "text": "Бориспільського району"},
        {"label": "PCT", "text": "30 %"}
    ]
}

# EXAMPLE6
EXAMPLE6: dict[str, str] = {
    "text": "Міжнародний благодійний фонд « Покуття », фундатором якого є народний депутат України Андрій Іванчук, підтримує спортивні школи у Коломиї.",
    "labels": [
        {"label": "ORG", "text": "Міжнародний благодійний фонд « Покуття »"},
        {"label": "JOB", "text": "народний депутат"},
        {"label": "LOG", "text": "України"},
        {"label": "PERS", "text": "Андрій Іванчук"},
        {"label": "LOG", "text": "Коломиї"}
    ]
}

# EXAMPLE7
EXAMPLE7: dict[str, str] = {
    "text": "Краєзнавець і тележурналіст Василь Нагірний випустив двомовну книжечку « А . Kubler . Світло і тіні маестро ».",
    "labels": [
        {"label": "JOB", "text": "Краєзнавець"},
        {"label": "JOB", "text": "тележурналіст"},
        {"label": "PERS", "text": "Василь Нагірний"},
        {"label": "ART", "text": "А . Kubler . Світло і тіні маестро"}
    ]
}

# EXAMPLE8
EXAMPLE8: dict[str, str] = {
    "text": "За словами заступника голови РДА Сергій Білецький наголосив ... Термін виконання: один тиждень.",
    "labels": [
        {"label": "JOB", "text": "заступника голови"},
        {"label": "ORG", "text": "РДА"},
        {"label": "PERS", "text": "Сергій Білецький"},
        {"label": "PERIOD", "text": "один тиждень"}
    ]
}

# EXAMPLE9
EXAMPLE9: dict[str, str] = {
    "text": "Присутні обговорили необхідність привести у відповідність до законодавчих норм Статутів та Положень закладів освіти.",
    "labels": [
        {"label": "DOC", "text": "Статутів"},
        {"label": "DOC", "text": "Положень"}
    ]
}

# EXAMPLE10
EXAMPLE10: dict[str, str] = {
    "text": "У неділю, 4 березня, у Чернівцях у ліцеї № 4 відбулися змагання з бойового гопака. Участь взяли 58 учасників.",
    "labels": [
        {"label": "DATE", "text": "4 березня"},
        {"label": "LOG", "text": "Чернівцях"},
        {"label": "ORG", "text": "ліцеї № 4"},
        {"label": "QUANT", "text": "58"}
    ]
}

# EXAMPLE11
EXAMPLE11: dict[str, str] = {
    "text": "Проукраїнська громадськість не сидить склавши руки Соціально активних людей із чіткою проукраїнською позицією в Луганську небагато – воно й не дивно, зважаючи на шалений пресинг усуціль провладних ЗМІ з їхньою проросійською пропагандою. І все ж ці люди пробують боротися з колишніми штатними комсомольцями в нинішній луганській владі, орієнтованій на зорі Кремля, та з численними активістами проросійських партій та рухів, й інколи навіть перемагають. Так, іще 1988 року в селі Олексіївка Перевальського району встановлено пам’ятник Борисові Грінченку на подвір’ї школи, в якій він учителював. 1991 року члени товариства « Меморіал » у Сучій Балці на околиці Луганська поставили хрест на місці розстрілу земляків комуно-більшовицькою владою у 1937-1942 роках, його тричі руйнували і тричі відновлювали – у 1994, 1997 і 2005 роках. 1998 року 4,5-метровий пам’ятник Тарасові Шевченку постав у центрі Луганська завдяки спонсорській підтримці Василя Іваницького з Канади; фізично перешкоджали його встановленню місцеві комуністи на чолі з їхніми вождями – Челишевим, Герасимовим, Смірновим. В окремих селах місцеві краєзнавці (такі, як Віра Аннусова, Олексій Погорілий, Василь Каплунов, Іван Кава) ще до указу В. Ющенка установили хрести на вшанування своїх померлих з голоду в 1933-му році односельців. У 90-т і на будинку в селі Половинкине на Старобільщині, де народився і жив Іван Світличний – відомий український дисидент, шанувальники його таланту встановили меморіальну дошку. Років два тому її хтось зірвав.",
    "labels": [
        {"label": "LOC", "text": "Луганську"},
        {"label": "MISC", "text": "ЗМІ"},
        {"label": "LOC", "text": "Кремля"},
        {"label": "DATE", "text": "1988 року"},
        {"label": "LOC", "text": "Олексіївка"},
        {"label": "LOC", "text": "Перевальського району"},
        {"label": "PERS", "text": "Борисові Грінченку"},
        {"label": "DATE", "text": "1991 року"},
        {"label": "ORG", "text": "товариства « Меморіал »"},
        {"label": "LOC", "text": "Сучій Балці"},
        {"label": "LOC", "text": "Луганська"},
        {"label": "PERIOD", "text": "1937-1942 роках"},
        {"label": "DATE", "text": "1937"},
        {"label": "DATE", "text": "1942"},
        {"label": "DATE", "text": "1994"},
        {"label": "DATE", "text": "1997"},
        {"label": "DATE", "text": "2005 роках"},
        {"label": "DATE", "text": "1998 року"},
        {"label": "QUANT", "text": "4,5-метровий"},
        {"label": "PERS", "text": "Тарасові Шевченку"},
        {"label": "PERS", "text": "Василя Іваницького"},
        {"label": "LOC", "text": "Канади"},
        {"label": "PERS", "text": "Челишевим"},
        {"label": "PERS", "text": "Герасимовим"},
        {"label": "PERS", "text": "Смірновим"},
        {"label": "PERS", "text": "Віра Аннусова"},
        {"label": "PERS", "text": "Олексій Погорілий"},
        {"label": "PERS", "text": "Василь Каплунов"},
        {"label": "PERS", "text": "Іван Кава"},
        {"label": "PERS", "text": "В. Ющенка"},
        {"label": "DATE", "text": "1933-му році"},
        {"label": "DATE", "text": "90-т і"},
        {"label": "LOC", "text": "Половинкине"},
        {"label": "LOC", "text": "Старобільщині"},
        {"label": "PERS", "text": "Іван Світличний"},
        {"label": "DATE", "text": "Років два тому"}
    ]
}

# EXAMPLE12
EXAMPLE12: dict[str, str] = {
    "text": "Іще на зорі незалежності Василь Каплунов, дослідивши історію рідного краю, встановив хрест на могилі поблизу Можняківки Новопсковського району, де поховані кінні гайдамаки Запорозького корпусу армії УНР, що захищали кордони України в 1918 році від більшовиків і денікінців. 2003 року противники української незалежності обстріляли з мисливської зброї табличку на цьому хресті, згодом над нею ще раз поглумилися, проїхавшись по ній трактором, а 2007 року взагалі зламали дубовий хрест на цьому місці. 2011 року в Стаханові вандали-українофоби вщент зруйнували погруддя Тараса Шевченка, яке стояло тут з 1961 року, і відтягли його уламки в невідомому напрямку.",
    "labels": [
        {"label": "DATE", "text": "Іще на зорі незалежності"},
        {"label": "PERS", "text": "Василь Каплунов"},
        {"label": "LOC", "text": "Можняківки"},
        {"label": "LOC", "text": "Новопсковського району"},
        {"label": "ORG", "text": "Запорозького корпусу армії УНР"},
        {"label": "LOC", "text": "України"},
        {"label": "DATE", "text": "1918 році"},
        {"label": "DATE", "text": "2003 року"},
        {"label": "DATE", "text": "2007 року"},
        {"label": "DATE", "text": "2011 року"},
        {"label": "LOC", "text": "Стаханові"},
        {"label": "PERS", "text": "Тараса Шевченка"},
        {"label": "DOC", "text": "хрест"},
        {"label": "DOC", "text": "хрест"},
        {"label": "DOC", "text": "хрест"},
        {"label": "JOB", "text": "вандали-українофоби"},
        {"label": "ART", "text": "погруддя Тараса Шевченка"},
        {"label": "DOC", "text": "хрест"}
    ]
}

# EXAMPLE13
EXAMPLE13: dict[str, str] = {
    "text": "Мешканці Дякової слободи Антрацитівського району вимагають від влади гідно вшанувати 200 своїх земляків, репресованих більшовицькою владою. Та ж влада, як і годиться, ніяк не реагує. Хто ж стане на постамент у сквері Пам’яті? Найбільші ж баталії п’ятий рік поспіль чиняться між проукраїнською громадою і міськими депутатами за збереження скверу Пам’яті на місці колишнього Гусинівського цвинтаря в центрі Луганська (на ньому з кінця XIX ст. поховані десятки тисяч людей, представників творчої інтелігенції, духовенства, жертви трьох голодоморів, двох воєн, сталінських репресій; а сьогодні на їхніх могилах розміщують дитячі майданчики й готові розміщувати розважальні заклади), а також за майбутній пам’ятник на вже підготовленому постаменті в центрі цього скверу. Депутати хотіли встановити тут фігуру Катерини II як «засновниці Луганська», громада ж (понад 30 організацій) – скульптуру Янгола-Охоронця. Були численні протестні мітинги проти Катерини як символу імперії та розпусти, колективні листи до міського голови Сергія Кравченка з вимогою не допустити такої ганьби; були громадські слухання з гнівними виступами представників громадськості. Цікаво, що під час оголошеного конкурсу громада зібрала понад 20 листів з 324 підписами за пам’ятник Янголові-Охоронцю, а прихильників Катерини II було 331 – це нардеп Колесніченко, ті ж «Молодогвардійці» Клінчаєва і працівники заводу «Маршал», власником якого є нинішній народний депутат від ПР Сергій Горохов (цю кількість апологетів російської цариці влада зліпила нашвидкуруч, злякавшись масової народної підтримки іншого пам’ятника вже наприкінці конкурсу). Нарешті, 2011 року луганські депутати стали на позицію здорового глузду й погодились таки на пам’ятник, запропонований громадою.",
    "labels": [
        {"label": "ORG", "text": "Мешканці Дякової слободи"},
        {"label": "LOG", "text": "Антрацитівського району"},
        {"label": "PERS", "text": "200 своїх земляків"},
        {"label": "ORG", "text": "репресованих більшовицькою владою"},
        {"label": "ORG", "text": "сквері Пам’яті"},
        {"label": "LOC", "text": "Гусинівського цвинтаря"},
        {"label": "LOC", "text": "Луганська"},
        {"label": "DATE", "text": "XIX ст."},
        {"label": "DOC", "text": "скверу Пам’яті"},
        {"label": "DOC", "text": "пам’ятник Янголові-Охоронцю"},
        {"label": "ORG", "text": "Тарасові Шевченку"},
        {"label": "DOC", "text": "пам’ятник"},
        {"label": "DOC", "text": "фігуру Катерини II"},
        {"label": "DOC", "text": "скульптуру Янгола-Охоронця"},
        {"label": "DATE", "text": "2011 року"},
        {"label": "DOC", "text": "пам’ятник"},
        {"label": "DOC", "text": "пам’ятник Янголові-Охоронцю"},
        {"label": "DOC", "text": "фігуру Катерини II"},
        {"label": "PERS", "text": "Катерини II"},
        {"label": "PERS", "text": "Янгола-Охоронця"},
        {"label": "ORG", "text": "Молодогвардійці"},
        {"label": "PERS", "text": "Колесніченко"},
        {"label": "PERS", "text": "Клінчаєва"},
        {"label": "ORG", "text": "заводу «Маршал»"},
        {"label": "PERS", "text": "Сергій Горохов"},
        {"label": "ORG", "text": "ПР"},
        {"label": "PERS", "text": "Катерини II"}
    ]
}

# EXAMPLE14
EXAMPLE14: dict[str, str] = {
    "text": "Виставу за п'єсою російського класика Льва Толстого поставили у столичному Театрі імені Франка. 28 квітня тут відбулася прем'єра спектаклю «Живий труп» у постановці режисера Романа Мархоліа. Відомо, що Толстой категорично не сприймав Шекспіра, бо вважав, що той вигадує забагато всього неправдоподібного, а на сцені все мусить бути, як у житті. За таким принципом створений і «Живий труп». В основі п'єси, написаної 1900 року, – події з реальної московської кримінальної хроніки. Головний герой, Федір Протасов, аристократ, інтелігент і добра душа, полюбив циганку Машу. Але він одружений, а закон не дозволяє розлучатися просто так. І тоді Федя, щоб звільнити дружину від себе, інсценує свою смерть. Дружина, тобто вже ніби вдова, бере шлюб з іншим. А тут спливає, що Протасов живий, і виходить, що його колишня дружина – двічі заміжня, а за це їй світить Сибір. І чесний Федя стріляється по-справжньому. Мораль у Толстого така: жити іноді буває так соромно, що чесніше – вмерти. Це майже як гамлетівське «бути чи не бути». Великі актори минулого дуже серйозно ставилися до ролі Феді. Її еталонним виконавцем понад півстоліття тому вважали Михайла Романова у київському Театрі російської драми. Пам'ять про це досі жива серед театралів. І, можливо, прем'єрна публіка чекала знову чогось подібного від спектаклю франківців та Олексія Богдановича в ролі Феді. Але тут усе – зовсім інакше, усе – всупереч тому, що ми знаємо про п'єсу. Її не впізнав би сам Толстой.",
    "labels": [
        {"label": "DOC", "text": "Виставу за п'єсою російського класика Льва Толстого"},
        {"label": "ORG", "text": "Театрі імені Франка"},
        {"label": "DATE", "text": "28 квітня"},
        {"label": "ART", "text": "Живий труп"},
        {"label": "DOC", "text": "прем'єра спектаклю «Живий труп»"},
        {"label": "JOB", "text": "режисера"},
        {"label": "PERS", "text": "Романа Мархоліа"},
        {"label": "PERS", "text": "Толстой"},
        {"label": "PERS", "text": "Шекспіра"},
        {"label": "PERS", "text": "Федір Протасов"},
        {"label": "PERS", "text": "Маша"},
        {"label": "PERS", "text": "Федя"},
        {"label": "PERS", "text": "Феді"},
        {"label": "PERS", "text": "Толстой"},
        {"label": "PERS", "text": "Толстой"},
        {"label": "PERS", "text": "Толстой"},
        {"label": "DOC", "text": "пам’ятник"},
        {"label": "DOC", "text": "фігуру Катерини II"},
        {"label": "DOC", "text": "скульптуру Янгола-Охоронця"},
        {"label": "DATE", "text": "2011 року"},
        {"label": "DOC", "text": "пам’ятник"},
        {"label": "DOC", "text": "пам’ятник Янголові-Охоронцю"},
        {"label": "DOC", "text": "фігуру Катерини II"},
        {"label": "PERS", "text": "Катерини II"},
        {"label": "PERS", "text": "Янгола-Охоронця"},
        {"label": "ORG", "text": "Молодогвардійці"},
        {"label": "PERS", "text": "Колесніченко"},
        {"label": "PERS", "text": "Клінчаєва"},
        {"label": "ORG", "text": "заводу «Маршал»"},
        {"label": "PERS", "text": "Сергій Горохов"},
        {"label": "ORG", "text": "ПР"},
        {"label": "PERS", "text": "Катерини II"}
    ]
}

# EXAMPLE15
EXAMPLE15: dict[str, str] = {
    "text": "Іще на зорі незалежності Василь Каплунов, дослідивши історію рідного краю, встановив хрест на могилі поблизу Можняківки Новопсковського району, де поховані кінні гайдамаки Запорозького корпусу армії УНР, що захищали кордони України в 1918 році від більшовиків і денікінців. 2003 року противники української незалежності обстріляли з мисливської зброї табличку на цьому хресті, згодом над нею ще раз поглумилися, проїхавшись по ній трактором, а 2007 року взагалі зламали дубовий хрест на цьому місці. 2011 року в Стаханові вандали-українофоби вщент зруйнували погруддя Тараса Шевченка, яке стояло тут з 1961 року, і відтягли його уламки в невідомому напрямку.",
    "labels": [
        {"label": "DATE", "text": "Іще на зорі незалежності"},
        {"label": "PERS", "text": "Василь Каплунов"},
        {"label": "LOC", "text": "Можняківки"},
        {"label": "LOC", "text": "Новопсковського району"},
        {"label": "ORG", "text": "Запорозького корпусу армії УНР"},
        {"label": "LOC", "text": "України"},
        {"label": "DATE", "text": "1918 році"},
        {"label": "DATE", "text": "2003 року"},
        {"label": "DATE", "text": "2007 року"},
        {"label": "DATE", "text": "2011 року"},
        {"label": "LOC", "text": "Стаханові"},
        {"label": "PERS", "text": "Тараса Шевченка"},
        {"label": "DOC", "text": "хрест"},
        {"label": "DOC", "text": "хрест"},
        {"label": "DOC", "text": "хрест"},
        {"label": "JOB", "text": "вандали-українофоби"},
        {"label": "ART", "text": "погруддя Тараса Шевченка"},
        {"label": "DOC", "text": "хрест"}
    ]
}

# EXAMPLE_NO_ENTITIES
EXAMPLE_NO_ENTITIES: dict[str, str] = {
    "text": "Це абсолютно нормальна практика, коли громади самостійно визначають пріоритети.",
    "labels": []
}

# ELEVEN_SHOT_EXAMPLES_DICT
ELEVEN_SHOT_EXAMPLES_DICT: list[dict[str, str]] = [
    EXAMPLE1,
    EXAMPLE2,
    EXAMPLE3,
    EXAMPLE4,
    EXAMPLE5,
    EXAMPLE6,
    EXAMPLE7,
    EXAMPLE8,
    EXAMPLE9,
    EXAMPLE10,
    EXAMPLE11
]

# FIFTEEN_SHOT_EXAMPLES_DICT
FIFTEEN_SHOT_EXAMPLES_DICT: list[dict[str, str]] = [
    EXAMPLE1,
    EXAMPLE2,
    EXAMPLE3,
    EXAMPLE4,
    EXAMPLE5,
    EXAMPLE6,
    EXAMPLE7,
    EXAMPLE8,
    EXAMPLE9,
    EXAMPLE10,
    EXAMPLE11,
    EXAMPLE12,
    EXAMPLE13,
    EXAMPLE14,
    EXAMPLE15
]

# FIVE_SHOT_EXAMPLES_DICT
FIVE_SHOT_EXAMPLES_DICT: list[dict[str, str]] = [
    EXAMPLE1,
    EXAMPLE2,
    EXAMPLE3,
    EXAMPLE4,
    EXAMPLE5
]

# THREE_SHOT_EXAMPLES_DICT
THREE_SHOT_EXAMPLES_DICT: list[dict[str, str]] = [
    EXAMPLE1,
    EXAMPLE2,
    EXAMPLE3
]

# ZERO_SHOT_EXAMPLES_DICT
ZERO_SHOT_EXAMPLES_DICT: list[dict[str, str]] = [
]
